DataProcessors/АвтозаполнениеЯчеистогоСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>АвтозаполнениеЯчеистогоСклада</Name>
			<Comment>Автозаполнение ячеистого склада</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыСкладов</Name>
			<Comment>Виды складов(Обычный, Ордерный, Ордерный и ячеистый)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
					<Comment>Обычный склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ордерный</Name>
					<Comment>Ордерный  склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрдерныйЯчеистый</Name>
					<Comment>Ордерный и ячеистый склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ячеистый</Name>
					<Comment>Ячеистый склад</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЯчейкиХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЯчейкиХранения</Name>
			<Comment>Места хранения товаров на складе</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СкладыКомпании</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлинаЯчейки</Name>
					<Comment>Длина ячейки в единицах размерности склада-владельца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЯчейки</Name>
					<Comment>Ширина ячейки в единицах размерности склада-владельца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаX</Name>
					<Comment>Координата X ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаY</Name>
					<Comment>Координата Y ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Comment>Координата Z ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветГруппы</Name>
					<Comment>Цвет ячеек, входящих в данную группу, для отображения в карте склада</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недоступна</Name>
					<Comment>Признак доступности (активности) ячейки. Например, ячейка недоступна, если она сломана, красится и т.д.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СкладыКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СкладыКомпании</Name>
			<Comment>Склады (места хранения) компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Материально ответственное лицо</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>График работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСклада</Name>
					<Comment>Обычный, Ордерный или Ордерный и ячеистый</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетЕдиницИзмерения</Name>
					<Comment>Вариант учета единиц измерения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Розничный</Name>
					<Comment>Признак розничного склада</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенРозничнойТорговли</Name>
					<Comment>Тип цен розничной торговли (для розничного склада)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаСклада</Name>
					<Comment>Длина склада в единицах размерности</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаСклада</Name>
					<Comment>Ширина склада в единицах размерности</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоУровней</Name>
					<Comment>Максимальное число уровней склада</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаРазмерности</Name>
					<Comment>Единица размерности для склада</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаЯчейкиПоУмолчанию</Name>
					<Comment>Длина ячейки по умолчанию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЯчейкиПоУмолчанию</Name>
					<Comment>Ширина ячейки по умолчанию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходX</Name>
					<Comment>Координата X точки выхода со склада</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходY</Name>
					<Comment>Координата Y точки выхода со склада</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходУровень</Name>
					<Comment>Координата Z точки выхода со склада (уровень)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходY</Name>
					<Comment>Координата Y точки входа в склад</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходX</Name>
					<Comment>Координата X точки входа в склад</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходУровень</Name>
					<Comment>Координата Z точки входа в склад (уровень)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаСклада</Name>
					<Comment>Изображение структуры склада для отчета "Карта склада"</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транзитный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияОстатковТоваровДоОбособленногоУчета</Name>
					<Comment>Организация остатков товаров до обособленного учета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/АвтозаполнениеЯчеистогоСклада/Forms/Форма/Ext/Form/Module.bsl
// Модуль формы обработки "Автозаполнение ячеистого склада"

#Область ОбработчикиСобытийФормы

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("Склад") ИЛИ НЕ ЗначениеЗаполнено(Параметры.Склад) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Данная обработка используется только объектами конфигурации.
		                          |Запрещен самостоятельный вызов.'"), , , , Отказ);
		Возврат;
	КонецЕсли;
	
	Склад               = Параметры.Склад;
	СтратегияЗаполнения = 1;
	Заголовок           = НСтр("ru='Автозаполнение ячеистого склада:'") + Символы.НПП + Склад.Наименование;
	
	ЗаполнитьПараметрыСклада();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеДиалогом();
	РассчитатьПараметрыЯчеек();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик события возникающего на клиенте при обработке выбора данных реквизита "Склад" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкладОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка, ПараметрыДействия = Неопределено)
	
	Если ВыбранноеЗначение.ВидСклада = Перечисления.ВидыСкладов.Ордерный ИЛИ ВыбранноеЗначение.ВидСклада = Перечисления.ВидыСкладов.Обычный Тогда
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Для данного склада заполнение невозможно. Необходимо выбрать ячеистый склад.'"));
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // СкладОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при обработке выбора данных реквизита "Склад".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкладОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// Обработаем событие в контексте сервера
	СкладОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры // СкладОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Склад".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	ЗаполнитьПараметрыСклада();
	
	РассчитатьПараметрыЯчеек();
	
КонецПроцедуры // СкладПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Стратегия заполнения".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СтратегияЗаполненияПриИзменении(Элемент)
	
	УправлениеДиалогом();
	
	РассчитатьПараметрыЯчеек();
	
КонецПроцедуры // СтратегияЗаполненияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Длина ячейки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПараметрыЯчеекПриИзменении(Элемент)
	
	РассчитатьПараметрыЯчеек();
	
КонецПроцедуры // ДлинаЯчейкиПриИзменении()

&НаКлиенте
Процедура ШиринаЧислоРядовПриИзменении(Элемент)
	
	РасчетПоРазмерам = СтратегияЗаполнения = 1;
	ШиринаЯчейки     = ?(РасчетПоРазмерам, ШиринаЧислоРядов, 0);
	ЧислоРядов       = ?(РасчетПоРазмерам, 0, ШиринаЧислоРядов);
	
	РассчитатьПараметрыЯчеек();
	
КонецПроцедуры

&НаКлиенте
Процедура ДлинаЧислоВРядуПриИзменении(Элемент)
	
	РасчетПоРазмерам = СтратегияЗаполнения = 1;
	ДлинаЯчейки = ?(РасчетПоРазмерам, ДлинаЧислоВРяду, 0);
	ЧислоЯчеек  = ?(РасчетПоРазмерам, 0, ДлинаЧислоВРяду);
	
	РассчитатьПараметрыЯчеек();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Обработчик события возникающего на клиенте при нажатии на кнопку "Выполнить"в контексте сервера.
//
// Параметры:
//  ПараметрыЯчеек  - Структура - Рассчитанные параметры ячеек склада.
//
&НаСервере
Процедура ВыполнитьЗаполнениеЯчеекНаСервере(ПараметрыЯчеек)
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Ошибка. Не выбран склад.'"));
		Возврат;
	КонецЕсли;
	
	// Проверим нет ли уже созданных ячеек (пока проверяем только корень).
	ВыборкаЯчейки = Справочники.ЯчейкиХранения.Выбрать(Справочники.ЯчейкиХранения.ПустаяСсылка(), Склад);
	Если Справочники.СкладыКомпании.ЕстьЗаполненныеЯчейки(Склад) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Для данного склада уже есть введенные ячейки.
		                          |Автозаполнение невозможно. Воспользуйтесь ручным вводом.'"));
		Возврат;
	КонецЕсли;
	
	// Проверим введенные данные формы.
	СтрокаПустыхПараметров = "";
	Если СтратегияЗаполнения = 1 Тогда
		
		СтрокаПустыхПараметров = СтрокаПустыхПараметров + ?(ДлинаЯчейки  = 0, Символы.ПС + Символы.Таб + "- " + НСтр("ru = 'Длина ячейки'") + ",", "");
		СтрокаПустыхПараметров = СтрокаПустыхПараметров + ?(ШиринаЯчейки = 0, Символы.ПС + Символы.Таб + "- " + НСтр("ru = 'Ширина ячейки'") + ",", "");
		
	ИначеЕсли СтратегияЗаполнения = 2 Тогда
		
		СтрокаПустыхПараметров = СтрокаПустыхПараметров + ?(ЧислоЯчеек = 0, Символы.ПС + Символы.Таб + "- " + НСтр("ru = 'Число ячеек'") + ",", "");
		СтрокаПустыхПараметров = СтрокаПустыхПараметров + ?(ЧислоРядов = 0, Символы.ПС + Символы.Таб + "- " + НСтр("ru = 'Число рядов'") + ",", "");
	КонецЕсли;
	
	Если СтрокаПустыхПараметров <> "" Тогда
		
		СтрокаПустыхПараметров  = НСтр("ru = 'Не заполнены параметры заполнения:'")
			+ Символы.НПП
			+ Лев(СтрокаПустыхПараметров, СтрДлина(СтрокаПустыхПараметров) - 1);
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Автозаполнение склада ячейками невозможно.'"));
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru='Не введены параметры заполнения:  %1'"), Лев(СтрокаПустыхПараметров, СтрДлина(СтрокаПустыхПараметров) - 1)));
		Возврат;
	КонецЕсли;
	
	// Вызываем процедуру заполнения склада ячейками.
	СоздатьЯчейки(ПараметрыЯчеек);
	
КонецПроцедуры // ВыполнитьЗаполнениеЯчеекНаСервере()

// Обработчик события возникающего на клиенте при нажатии на кнопку "Выполнить".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ВыполнитьЗаполнениеЯчеек(Команда)
	
	ПараметрыЯчеек = ПараметрыЯчеек();
	
	// Обработаем событие в контексте сервера
	ВыполнитьЗаполнениеЯчеекНаСервере(ПараметрыЯчеек);
	
	Оповестить("ОбработкаОповещения", , ВладелецФормы);
	Закрыть();
	
КонецПроцедуры // ВыполнитьЗаполнениеЯчеек()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Производит настройку отображения элементов управления диалога в зависимости от значений реквизитов объекта.
&НаКлиенте
Процедура УправлениеДиалогом()
	
	РасчетПоРазмерам = СтратегияЗаполнения = 1;
	
	Элементы.ДлинаЧислоВРяду.Заголовок  = ?(РасчетПоРазмерам, НСтр("ru = 'Длина ячейки'"),  НСтр("ru = 'Число ячеек'"));
	Элементы.ШиринаЧислоРядов.Заголовок = ?(РасчетПоРазмерам, НСтр("ru = 'Ширина ячейки'"), НСтр("ru = 'Число рядов'"));
	
	ШиринаЧислоРядов = ?(РасчетПоРазмерам, ШиринаЯчейки, ЧислоРядов);
	ДлинаЧислоВРяду  = ?(РасчетПоРазмерам, ДлинаЯчейки,  ЧислоЯчеек);
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Выводит на форму параметры выбранного склада
&НаСервере
Процедура ЗаполнитьПараметрыСклада()
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Склад, "ДлинаСклада, ШиринаСклада, ЧислоУровней, ЕдиницаРазмерности");
	
	ДлинаЯчейки  = Склад.ДлинаЯчейкиПоУмолчанию;
	ШиринаЯчейки = Склад.ШиринаЯчейкиПоУмолчанию;
	
КонецПроцедуры // ЗаполнитьПараметрыСклада()

// Выводит расчетные значения по ячейкам (размеры или количество).
&НаКлиенте
Процедура РассчитатьПараметрыЯчеек()
	
	ПараметрыЯчеек = ПараметрыЯчеек();
	ВывестиРасчетныеЗначения(ПараметрыЯчеек);
	
КонецПроцедуры // РассчитатьПараметрыЯчеек()

// Выводит расчетные значения по ячейкам (размеры или количество).
//
// Параметры:
//  ПараметрыЯчеек  - Структура - Рассчитанные параметры ячеек склада.
//
&НаСервере
Процедура ВывестиРасчетныеЗначения(ПараметрыЯчеек)
	
	РасчетПоРазмерам = СтратегияЗаполнения = 1;
	
	КоличествоЯчеекДлина = ?(РасчетПоРазмерам, ПараметрыЯчеек.КоличествоЯчеек, ПараметрыЯчеек.СредняяДлинаЯчейки);
	Элементы.КоличествоЯчеекДлина.Заголовок = ?(РасчетПоРазмерам, НСтр("ru = 'Ячеек в ряде'"), "Длина");
	Элементы.КоличествоЯчеекДлина.Подсказка = ?(РасчетПоРазмерам, НСтр("ru = 'Расчетное количество ячеек в ряде'"), НСтр("ru = 'Расчетная длина создаваемой ячейки'"));
	
	КоличествоРядовШирина = ?(РасчетПоРазмерам, ПараметрыЯчеек.КоличествоРядов, ПараметрыЯчеек.СредняяШиринаЯчейки);
	Элементы.КоличествоРядовШирина.Заголовок = ?(РасчетПоРазмерам, НСтр("ru = 'Количество рядов'"), "Ширина");
	Элементы.КоличествоРядовШирина.Подсказка = ?(РасчетПоРазмерам, НСтр("ru = 'Расчетное количество рядов ячеек'"), НСтр("ru = 'Расчетная ширина создаваемой ячейки'"));
	
	ОбщееЧислоЯчеек =  ?(РасчетПоРазмерам, ПараметрыЯчеек.КоличествоЯчеек, ЧислоРядов) * ?(РасчетПоРазмерам, ПараметрыЯчеек.КоличествоРядов, ЧислоЯчеек) * ЧислоУровней;
	
КонецПроцедуры // ВывестиРасчетныеЗначения()

// Рассчитаем размеры или количество ячеек, исходя из указанных размеров ячеек и склада и стратегии заполнения.
//
// Возвращаемое значение:
//   Структура  - КоличествоЯчеек, КоличествоРядов, СредняяДлинаЯчейки, СредняяШиринаЯчейки.
//
&НаКлиенте
Функция ПараметрыЯчеек()
	
	ПараметрыЯчеек = Новый Структура();
	ПараметрыЯчеек.Вставить("КоличествоЯчеек",     0);
	ПараметрыЯчеек.Вставить("КоличествоРядов",     0);
	ПараметрыЯчеек.Вставить("СредняяДлинаЯчейки",  0);
	ПараметрыЯчеек.Вставить("СредняяШиринаЯчейки", 0);
	
	Если СтратегияЗаполнения = 1 Тогда
		
		// Длину склада увеличиваем на величину зазора, поскольку зазоры между крайними ячейками и стенами не учитываем.
		ПараметрыЯчеек.КоличествоЯчеек = ?(ДлинаЯчейки  > 0, Цел((ДлинаСклада  + Зазор) / (ДлинаЯчейки  + Зазор)), 0);
		ПараметрыЯчеек.КоличествоРядов = ?(ШиринаЯчейки > 0, Цел((ШиринаСклада + Зазор) / (ШиринаЯчейки + Зазор)), 0);
		
		ЧислоЯчеек = ПараметрыЯчеек.КоличествоЯчеек;
		ЧислоРядов = ПараметрыЯчеек.КоличествоРядов;
		
	ИначеЕсли СтратегияЗаполнения = 2 Тогда
		
		// Округляем в меньшую сторону, чтобы ячейки не "вылезли" за пределы склада
		ПараметрыЯчеек.СредняяДлинаЯчейки  = ?(ЧислоЯчеек > 0, Окр((ДлинаСклада  + Зазор) / ЧислоЯчеек, 2, РежимОкругления.Окр15как10) - Зазор, 0);
		ПараметрыЯчеек.СредняяШиринаЯчейки = ?(ЧислоРядов > 0, Окр((ШиринаСклада + Зазор) / ЧислоРядов, 2, РежимОкругления.Окр15как10) - Зазор, 0);
		
		ДлинаЯчейки  = ПараметрыЯчеек.СредняяДлинаЯчейки;
		ШиринаЯчейки = ПараметрыЯчеек.СредняяШиринаЯчейки;
		
	КонецЕсли;
	
	Возврат ПараметрыЯчеек;
	
КонецФункции // РассчитатьКоличествоЯчеек()

// Процедура заполнения выбранного склада ячейками.
&НаСервере
Процедура СоздатьЯчейки(ПараметрыЯчеек)
	
	РасчетПоРазмерам = СтратегияЗаполнения = 1;
	
	КоличествоЯчеек = ?(РасчетПоРазмерам, ПараметрыЯчеек.КоличествоЯчеек, ЧислоЯчеек);
	КоличествоРядов = ?(РасчетПоРазмерам, ПараметрыЯчеек.КоличествоРядов, ЧислоРядов);
	ТекДлинаЯчейки  = ?(РасчетПоРазмерам, ДлинаЯчейки,  ПараметрыЯчеек.СредняяДлинаЯчейки);
	ТекШиринаЯчейки = ?(РасчетПоРазмерам, ШиринаЯчейки, ПараметрыЯчеек.СредняяШиринаЯчейки);
	
	// Координаты x, y и z начинаются с нуля.
	Для x = 0 По КоличествоЯчеек - 1 Цикл
		
		Для y = 0 По КоличествоРядов - 1 Цикл
			
			Для z = 0 По ЧислоУровней - 1 Цикл
				
				НовыйЭлемент = Справочники.ЯчейкиХранения.СоздатьЭлемент();
				НовыйЭлемент.Владелец     = Склад;
				НовыйЭлемент.КоординатаX  = x * (ТекДлинаЯчейки  + Зазор);
				НовыйЭлемент.КоординатаY  = y * (ТекШиринаЯчейки + Зазор);
				НовыйЭлемент.Уровень      = z;
				НовыйЭлемент.ДлинаЯчейки  = ТекДлинаЯчейки;
				НовыйЭлемент.ШиринаЯчейки = ТекШиринаЯчейки;
				НовыйЭлемент.Недоступна   = Ложь;
				НовыйЭлемент.Код          = Строка(x + 1) + "-" + Строка(y + 1) + "-" + Строка(z);
				НовыйЭлемент.Записать();
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // СоздатьЯчейки()

#КонецОбласти
